/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC15F4K60S4 系列 掉电唤醒定时器举例----------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966-------------------------*/
/* --- Web: www.STCMCU.com --------------------------------------------*/
/* --- Web: www.GXWMCU.com --------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了STC的资料及程序        */
/* 如果要在文章中应用此代码,请在文章中注明使用了STC的资料及程序        */
/*---------------------------------------------------------------------*/

//本示例在Keil开发环境下请选择Intel的8058芯片型号进行编译
//若无特别说明,工作频率一般为11.0592MHz



#include "defines.h"

//-----------------------------------------------

//sfr WKTCL = 0xaa;                   //掉电唤醒定时器计时低字节
//sfr WKTCH = 0xab;                   //掉电唤醒定时器计时高字节

//sbit P10 = P1^0;

//-----------------------------------------------
void InitPort(){

//By HeYC	P1M0=0xb7;  //p1 mode	1011 0111
	P1M0=0xB4;//By HeYC	1011 0100
	P1M1=0x00;
	P3M0=0x13;  //p3 mode 0001 0011
	P3M1=0x00;
}

void main()
{
    WKTCL = 0x05;                     //设置唤醒周期为488us*(49+1) = 24.4ms
    WKTCH = 0xA8;                   //使能掉电唤醒定时器
    InitPort();
	
    while (1)
    {
        PCON = 0x02;                //进入掉电模式
        _nop_();                    //掉电模式被唤醒后,直接从此语句开始向下执行,不进入中断服务程序
        _nop_();
        //P10 = !P10;                 //掉电唤醒后,取反测试口
			MSG_LED_1=!MSG_LED_1;
    }
}

